{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"batch_input_shape": [null, 1], "bias_regularizer": null, "name": "dense", "units": 1, "bias_constraint": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "custom_activation_sigm_der"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "units": 1, "bias_constraint": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "custom_activation_ln"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "units": 2, "bias_constraint": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "custom_activation_exp"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_3", "units": 2, "bias_constraint": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "custom_activation_sigm_der"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_4", "units": 1, "bias_constraint": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "custom_activation_ln"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_5", "units": 1, "bias_constraint": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "activation": "linear"}}], "backend": "tensorflow", "keras_version": "2.1.6-tf"}